app/views/items/index.html.erb

				<div class='btn-group'>
					<% cart = Cart.find(1) %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]