app/views/items/show.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
---
		<div class='btn-group'>
			<% cart = Cart.find(2) %>