app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "numitem", "purchased", "total", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 18 Feb 2014 01:05:38 UTC +00:00], ["numitem", 2], ["purchased", true], ["total", 4.0], ["updated_at", Tue, 18 Feb 2014 01:05:38 UTC +00:00]]