app/controllers/clients_controller.rb

INSERT INTO "clients" ("apellido", "birthday", "created_at", "direccion", "nombre", "passw", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save