app/controllers/items_controller.rb

INSERT INTO "items" ("code", "color", "created_at", "descripcion", "nombreitem", "updated_at", "valor") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save